profiling/results/stage-4_wrk_put.log
Running 1m test @ http://localhost:8080
  2 threads and 10 connections
  Thread calibration: mean lat.: 3.912ms, rate sampling interval: 12ms
  Thread calibration: mean lat.: 3.979ms, rate sampling interval: 11ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.45ms    5.94ms 141.95ms   98.41%
    Req/Sec   526.12    121.87     1.67k    80.76%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.80ms
 75.000%    2.36ms
 90.000%    3.12ms
 99.000%   10.47ms
 99.900%  113.60ms
 99.990%  137.60ms
 99.999%  142.08ms
100.000%  142.08ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.261     0.000000            1         0.00
       1.069     0.100000         5016 1203947227023143301256189861386337789551427650757181365349027638945094161125536407452473214359529595887917169557085027731865362867515770381017821158220863163008235290230241011428089499786483364104597294698902989176212385163908269767309393920.00
       1.289     0.200000        10020         0.00
       1.466     0.300000        14994        -0.00
       1.634     0.400000        20015        -0.00
       1.805     0.500000        24998         0.00
       1.894     0.550000        27500 1203947227023143301256189861386337789551427650757181365349027638945094161125536407452473214359529595887917169557085027731865362867515770381017821158220863163008235290230241011428089499786483364104597294698902989176212385163908269767309393920.00
       1.993     0.600000        29988         0.00
       2.095     0.650000        32513        -0.00
       2.213     0.700000        34992        -0.00
       2.355     0.750000        37501         0.00
       2.431     0.775000        38748 1203947227023143301256189861386337789551427650757181365349027638945094161125536407452473214359529595887917169557085027731865362867515770381017821158220863163008235290230241011428089499786483364104597294698902989176212385163908269767309393920.00
       2.521     0.800000        39975         0.00
       2.625     0.825000        41223        -0.00
       2.751     0.850000        42474        -0.00
       2.905     0.875000        43728         0.00
       2.997     0.887500        44348 1203945637244616785330240268831341603948811067705899837851697832555807222449360856602541611540038955353923748257648793869646399747817805207447884319270693520838748744868345566077786216314830877347789793629591814810548384249633091459666149376.00
       3.115     0.900000        44973         0.00
       3.261     0.912500        45593        -0.00
       3.461     0.925000        46222        -0.00
       3.739     0.937500        46842         0.00
       3.919     0.943750        47157 1203945637244616785330240268831341603948811067705899837851697832555807222449360856602541611540038955353923748257648793869646399747817805207447884319270693520838748744868345566077786216314830877347789793629591814810548384249633091459666149376.00
       4.147     0.950000        47473         -nan
       4.499     0.956250        47779        -0.00
       4.927     0.962500        48092        -0.00
       5.567     0.968750        48403         0.00
       5.999     0.971875        48559 1203953586137249364959988231606322531961893982962307475338346864502241915830238610852199625637492158023890854754829963180741215346307631075297568514021541731686181471677822792829302633673093311131827298976147686638868388821008982997882372096.00
       6.479     0.975000        48715         -nan
       7.007     0.978125        48873        -0.00
       7.671     0.981250        49028        -0.00
       8.535     0.984375        49186         0.00
       9.023     0.985938        49263 1203953586137249364959988231606322531961893982962307475338346864502241915830238610852199625637492158023890854754829963180741215346307631075297568514021541731686181471677822792829302633673093311131827298976147686638868388821008982997882372096.00
       9.559     0.987500        49340         0.00
      10.159     0.989062        49418        -0.00
      10.727     0.990625        49496        -0.00
      11.743     0.992188        49574         0.00
      12.447     0.992969        49613 1203921790566719046440996380506398819909562321936676925391750736716503142306727593853567569247679347344022428766105285936361952952348327603898831735018148888296450564439913885823236964240043575995677277589924199325588370535505416845017481216.00
      13.783     0.993750        49652         0.00
      16.479     0.994531        49691        -0.00
      23.311     0.995313        49730        -0.00
      36.959     0.996094        49769         0.00
      48.703     0.996484        49789 1203921790566719046440996380506398819909562321936676925391750736716503142306727593853567569247679347344022428766105285936361952952348327603898831735018148888296450564439913885823236964240043575995677277589924199325588370535505416845017481216.00
      57.855     0.996875        49808         -nan
      68.415     0.997266        49828        -0.00
      79.167     0.997656        49847        -0.00
      91.775     0.998047        49867         0.00
      96.383     0.998242        49877 1204047383070313804591014192351097482516272382987917597680805441470171297724596110998164191987439949529502711421567761051660039408487576315923842012081550619685887648029654068497196358500590029783469862065506974213044442763244503148833800192.00
      98.751     0.998437        49886         -nan
     103.679     0.998633        49896        -0.00
     109.311     0.998828        49906        -0.00
     113.855     0.999023        49916         0.00
     116.863     0.999121        49921 1204047383070313804591014192351097482516272382987917597680805441470171297724596110998164191987439949529502711421567761051660039408487576315923842012081550619685887648029654068497196358500590029783469862065506974213044442763244503148833800192.00
     118.143     0.999219        49925         0.00
     121.599     0.999316        49930        -0.00
     124.287     0.999414        49935        -0.00
     127.295     0.999512        49940         0.00
     128.383     0.999561        49943 1203545013055934771990942944972302832089432138782954908524586622455498676053122042419777701028397540787581580799717860590467693583930581467823800903827943694128139313670693337801358781458404214632299524163175874663220153852288157933568524288.00
     129.087     0.999609        49945         0.00
     129.407     0.999658        49947        -0.00
     132.607     0.999707        49951        -0.00
     133.247     0.999756        49952         0.00
     134.399     0.999780        49954 1203545013055934771990942944972302832089432138782954908524586622455498676053122042419777701028397540787581580799717860590467693583930581467823800903827943694128139313670693337801358781458404214632299524163175874663220153852288157933568524288.00
     134.783     0.999805        49955         -nan
     135.039     0.999829        49956        -0.00
     135.423     0.999854        49957        -0.00
     135.679     0.999878        49958         0.00
     137.599     0.999890        49959 1205554493113450902391227934487481433796793115602805665149461898514189162739018316733323664864567175755266103287117462435237076882158560860223965336842371396359132651106536260584709089627147475236980875772500272862517309496113538794629627904.00
     138.111     0.999902        49960         -nan
     138.111     0.999915        49960        -0.00
     138.879     0.999927        49961        -0.00
     138.879     0.999939        49961         0.00
     139.647     0.999945        49962 1205554493113450902391227934487481433796793115602805665149461898514189162739018316733323664864567175755266103287117462435237076882158560860223965336842371396359132651106536260584709089627147475236980875772500272862517309496113538794629627904.00
     139.647     0.999951        49962         0.00
     139.647     0.999957        49962        -0.00
     140.031     0.999963        49963        -0.00
     140.031     0.999969        49963         0.00
     140.031     0.999973        49963 1197515777994123122827113180149268934166040916797761874901295891084783746657345444054174008110143315617531302687800938125050062129397660703838339185309575766350416028682216846776156215216348189439851718800547092882496686463674426196563591168.00
     140.031     0.999976        49963         0.00
     140.031     0.999979        49963        -0.00
     142.079     0.999982        49964        -0.00
     142.079     1.000000        49964         0.00
#[Mean    =        2.448, StdDeviation   =        5.941]
#[Max     =      141.952, Total count    =        49964]
#[Buckets =           19, SubBuckets     =         2048]
----------------------------------------------------------
  59984 requests in 1.00m, 4.75MB read
Requests/sec:    999.82
Transfer/sec:     81.04KB